src/Catalogs/Scan_ДополнительныеРеквизиты1БД/Scan_ДополнительныеРеквизиты1БД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ДополнительныеРеквизиты1БД</name>
  <predefined>
    <items>
      <name>ADDate</name>
      <description>ADDate</description>
    </items>
    <items>
      <name>AssemblyLevel</name>
      <description>Assembly level</description>
    </items>
    <items>
      <name>CDDate</name>
      <description>CDDate</description>
    </items>
    <items>
      <name>CDDateDeviated</name>
      <description>CDDateDeviated</description>
    </items>
    <items>
      <name>DateOut</name>
      <description>DateOut</description>
    </items>
    <items>
      <name>DCD</name>
      <description>DCD</description>
    </items>
    <items>
      <name>DD</name>
      <description>DD</description>
    </items>
    <items>
      <name>DD2</name>
      <description>DD2</description>
    </items>
    <items>
      <name>DDDate</name>
      <description>DDDate</description>
    </items>
    <items>
      <name>DDDate_Confirmed</name>
      <description>DDDate_Confirmed</description>
    </items>
    <items>
      <name>DDS</name>
      <description>DDS</description>
    </items>
    <items>
      <name>DealerID_COW</name>
      <description>DealerID_COW</description>
    </items>
    <items>
      <name>DeliveryAdrCode_Confirmed</name>
      <description>DeliveryAdrCode_Confirmed</description>
    </items>
    <items>
      <name>DeliveryDate</name>
      <description>DeliveryDate</description>
    </items>
    <items>
      <name>DLV</name>
      <description>DLV</description>
    </items>
    <items>
      <name>EngineNo</name>
      <description>EngineNo</description>
    </items>
    <items>
      <name>FactoryInvoiceDate</name>
      <description>FactoryInvoiceDate</description>
    </items>
    <items>
      <name>FFU_No_Confirmed</name>
      <description>FFU_No_Confirmed</description>
    </items>
    <items>
      <name>FinishDate</name>
      <description>FinishDate</description>
    </items>
    <items>
      <name>OrderType</name>
      <description>OrderType</description>
    </items>
    <items>
      <name>PartPeriod</name>
      <description>PartPeriod</description>
    </items>
    <items>
      <name>PDDate</name>
      <description>PDDate</description>
    </items>
    <items>
      <name>ProductId</name>
      <description>Product id</description>
    </items>
    <items>
      <name>PRU</name>
      <description>PRU</description>
    </items>
    <items>
      <name>QuotationNumber</name>
      <description>Quotation number</description>
    </items>
    <items>
      <name>RetailCustomerName</name>
      <description>RetailCustomerName</description>
    </items>
    <items>
      <name>S_Ord_No_Confirmed</name>
      <description>S_Ord_No_Confirmed</description>
    </items>
    <items>
      <name>SDDate</name>
      <description>SDDate</description>
    </items>
    <items>
      <name>StatusID</name>
      <description>StatusID</description>
    </items>
    <items>
      <name>STDUO</name>
      <description>STDUO</description>
    </items>
    <items>
      <name>TLMS</name>
      <description>TLMS</description>
    </items>
    <items>
      <name>VINКод</name>
      <description>VIN-код</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочты</name>
      <description>Адрес электронной почты</description>
    </items>
    <items>
      <name>Валюта</name>
      <description>Валюта</description>
    </items>
    <items>
      <name>ВалютнаяОговорка</name>
      <description>Валютная оговорка</description>
    </items>
    <items>
      <name>ВесБрутто</name>
      <description>Вес брутто</description>
    </items>
    <items>
      <name>ВидТахографа</name>
      <description>Вид тахографа</description>
    </items>
    <items>
      <name>ВысотаНезагруженногоТС</name>
      <description>Высота незагруженного ТС</description>
    </items>
    <items>
      <name>ГосНомер</name>
      <description>Гос номер</description>
    </items>
    <items>
      <name>ГруппаКомпаний</name>
      <description>Группа компаний</description>
    </items>
    <items>
      <name>ДатаОкончанияОСАГО</name>
      <description>Дата окончания ОСАГО</description>
    </items>
    <items>
      <name>ДатаРегистрации</name>
      <description>Дата регистрации</description>
    </items>
    <items>
      <name>ДилерАктивен</name>
      <description>Дилер активен</description>
    </items>
    <items>
      <name>ДилерЗаказчикCOW</name>
      <description>Дилер заказчик COW</description>
    </items>
    <items>
      <name>ДлинаОбщая</name>
      <description>Длина общая</description>
    </items>
    <items>
      <name>ЗаводскаяГарантияДействительнаДо</name>
      <description>Заводская гарантия, действительна до</description>
    </items>
    <items>
      <name>ЗамечаниеПоАктуПП</name>
      <description>Замечание по акту ПП</description>
    </items>
    <items>
      <name>ИдентификационныйНомер</name>
      <description>Идентификационный номер</description>
    </items>
    <items>
      <name>ИноеНаименованиеТСПоЭПТС</name>
      <description>Иное наименование ТС по ЭПТС</description>
    </items>
    <items>
      <name>Иностранец</name>
      <description>Иностранец</description>
    </items>
    <items>
      <name>КаптивныйДилер</name>
      <description>Каптивный дилер</description>
    </items>
    <items>
      <name>КодДилера</name>
      <description>Код дилера</description>
    </items>
    <items>
      <name>КодДилераSOWA</name>
      <description>Код дилера SOWA</description>
    </items>
    <items>
      <name>Комментарий</name>
      <description>Комментарий</description>
    </items>
    <items>
      <name>КоммерческоеНаименование</name>
      <description>Коммерческое наименование</description>
    </items>
    <items>
      <name>КонтактныйТелефон</name>
      <description>Контактный телефон</description>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Контрагент</description>
    </items>
    <items>
      <name>КонтрольныеПриборыСерийныйТекущий</name>
      <description>Контрольные приборы. Серийный №, текущий</description>
    </items>
    <items>
      <name>ЛогистическийТипПродукта</name>
      <description>Логистический тип продукта</description>
    </items>
    <items>
      <name>ЛокальныйСтатус</name>
      <description>Локальный статус</description>
    </items>
    <items>
      <name>МаркаПоЭПТС</name>
      <description>Марка по ЭПТС</description>
    </items>
    <items>
      <name>МаркетинговыйТипПродукта</name>
      <description>Маркетинговый тип продукта</description>
    </items>
    <items>
      <name>МенеджерТС</name>
      <description>Менеджер т/с</description>
    </items>
    <items>
      <name>МестоПроизводства</name>
      <description>Место производства</description>
    </items>
    <items>
      <name>Модель</name>
      <description>Модель</description>
    </items>
    <items>
      <name>МодельПоПТС</name>
      <description>Модель по ПТС</description>
    </items>
    <items>
      <name>Наименование</name>
      <description>Наименование</description>
    </items>
    <items>
      <name>НаименованиеАнглийское</name>
      <description>Наименование английское</description>
    </items>
    <items>
      <name>НаименованиеПолное</name>
      <description>Наименование полное</description>
    </items>
    <items>
      <name>НаименованиеСокращенное</name>
      <description>Наименование сокращенное</description>
    </items>
    <items>
      <name>НаименованиеТСОпределяемоеЕгоНазначением</name>
      <description>Наименование ТС, определяемое его назначением</description>
    </items>
    <items>
      <name>НомерОСАГО</name>
      <description>Номер ОСАГО</description>
    </items>
    <items>
      <name>НомерСтандартнойСпецификации</name>
      <description>Номер стандартной спецификации</description>
    </items>
    <items>
      <name>НомерШассиРамы</name>
      <description>Номер шасси (рамы)</description>
    </items>
    <items>
      <name>ОбозначениеМоделиДвигателя</name>
      <description>Обозначение модели двигателя</description>
    </items>
    <items>
      <name>ПочтовыйАдрес</name>
      <description>Почтовый адрес</description>
    </items>
    <items>
      <name>ПродавецДилера</name>
      <description>Продавец дилера</description>
    </items>
    <items>
      <name>РегиональныйМенеджерОКП</name>
      <description>Региональный менеджер ОКП</description>
    </items>
    <items>
      <name>РегиональныйМенеджерОП</name>
      <description>Региональный менеджер ОП</description>
    </items>
    <items>
      <name>РегиональныйМенеджерОПАвтобусов</name>
      <description>Региональный менеджер ОП автобусов</description>
    </items>
    <items>
      <name>СебестоимостьЛогистическая</name>
      <description>Себестоимость логистическая</description>
    </items>
    <items>
      <name>СегментРынка</name>
      <description>Сегмент рынка</description>
    </items>
    <items>
      <name>СОППоБУ</name>
      <description>СОП по Б/У</description>
    </items>
    <items>
      <name>СрокУстраненияНедостатковДата</name>
      <description>Срок устранения недостатков дата</description>
    </items>
    <items>
      <name>СрокУстраненияНедостатковДни</name>
      <description>Срок устранения недостатков дни</description>
    </items>
    <items>
      <name>Статус</name>
      <description>Статус</description>
    </items>
    <items>
      <name>СтатусКомпании</name>
      <description>Статус компании</description>
    </items>
    <items>
      <name>СтатусПредоплаты</name>
      <description>Статус предоплаты</description>
    </items>
    <items>
      <name>СтатусПродукта</name>
      <description>Статус продукта</description>
    </items>
    <items>
      <name>СуммаПродажиДилеру</name>
      <description>Сумма продажи дилеру</description>
    </items>
    <items>
      <name>Тахограф</name>
      <description>Тахограф</description>
    </items>
    <items>
      <name>ТахографУстановлен</name>
      <description>Тахограф установлен</description>
    </items>
    <items>
      <name>ТипГИБДД</name>
      <description>Тип ГИБДД</description>
    </items>
    <items>
      <name>ТипДилера</name>
      <description>Тип дилера</description>
    </items>
    <items>
      <name>ТипКабины</name>
      <description>Тип кабины</description>
    </items>
    <items>
      <name>ТипКузова</name>
      <description>Тип кузова</description>
    </items>
    <items>
      <name>ТипПродукта</name>
      <description>Тип продукта</description>
    </items>
    <items>
      <name>Топливо</name>
      <description>Топливо</description>
    </items>
    <items>
      <name>БУ</name>
      <description>Транспортное средство с пробегом</description>
    </items>
    <items>
      <name>УровеньТоксичности</name>
      <description>Уровень токсичности</description>
    </items>
    <items>
      <name>УстановленныйТахограф</name>
      <description>Установленный тахограф</description>
    </items>
    <items>
      <name>ФормаКомпании</name>
      <description>Форма компании</description>
    </items>
    <items>
      <name>ЦветКабиныПТС</name>
      <description>Цвет кабины ПТС</description>
    </items>
    <items>
      <name>Ширина</name>
      <description>Ширина</description>
    </items>
    <items>
      <name>ЭПТС</name>
      <description>ЭПТС</description>
    </items>
    <items>
      <name>ЮридическийАдрес</name>
      <description>Юридический адрес</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВOFMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВOFMSДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметДопРеквизита1БД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДопРеквизита1БД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДопРеквизитаOFMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_ДополнительныеРеквизиты1БД/Forms/ФормаАдминистрирование/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //rarus bonmak 17468 23.09.2021 ++
	ЗаполнитьДанныеВТаблице();
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДопРеквизитов

&НаКлиенте
Процедура СписокДопРеквизитовТипДанныхOFMSНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) //rarus bonmak 17468 23.09.2021 ++
	СтандартнаяОбработка = Ложь;
	СписокВыбора = ОбработатьСписокВыбора(); 
	СписокВыбора.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ОбработатьРезультатВыгрузки", ЭтотОбъект, ),"Выберите тип данных",);
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

&НаСервере
Функция ОбработатьСписокВыбора() //rarus bonmak 17468 23.09.2021 ++
	Возврат Справочники.Scan_ДополнительныеРеквизиты1БД.ПолучитьСписокВыбора();
КонецФункции //rarus bonmak 17468 23.09.2021 --

&НаКлиенте
Процедура ОбработатьРезультатВыгрузки(ВыбранныйЭлемент,ДополнительныеПараметры) Экспорт //rarus bonmak 17468 23.09.2021 ++    
	Если ВыбранныйЭлемент = Неопределено Тогда 
		Возврат;
	КонецЕсли;   
	
	УстановитьЗначениеРеквизитаНаСервере(ВыбранныйЭлемент.Значение);        
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

&НаСервере
Процедура УстановитьЗначениеРеквизитаНаСервере(Значение) //rarus bonmak 17468 23.09.2021 ++
	ИдентификаторСтроки = Элементы.СписокДопРеквизитов.ТекущаяСтрока;
	СтрокаТЗ = СписокДопРеквизитов.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаТЗ.ТипДанныхOFMS = Значение;
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбработку(Команда) //rarus bonmak 17468 23.09.2021 ++
	ВыполнитьНаСервере();
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

&НаСервере
Процедура ВыполнитьНаСервере() //rarus bonmak 17468 23.09.2021 ++
	СтруктураОтбора = Новый Структура("Флаг", Истина);
	НайденныеСтроки = СписокДопРеквизитов.НайтиСтроки(СтруктураОтбора);
	ЕстьОшибки = ВыполнитьПроверки(НайденныеСтроки);
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ПривязатьПерепривязатьЭлементыИз1БД(НайденныеСтроки);
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

&НаСервере
Функция ВыполнитьПроверки(НайденныеСтроки) //rarus bonmak 17468 23.09.2021 ++
	ЕстьОшибки = Ложь;
	Если НайденныеСтроки.Количество() = 0 Тогда
		ТекстОшибки = "Не установлен ни один флажок";
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из НайденныеСтроки Цикл
		Если ЭлементМассива.ЭлементOFMS.Пустая()
			ИЛИ ПустаяСтрока(ЭлементМассива.ТипДанныхOFMS)
			ИЛИ (НЕ ЭлементМассива.Получение И НЕ ЭлементМассива.Отправка) Тогда
			ТекстОшибки = "У элемента " + ЭлементМассива.Элемент1БД  + " не заполнено обязательное поле «Элемент OFMS» или «Получение или Отправка» или «Тип данных OFMS»";
			ИндексСтроки = СписокДопРеквизитов.Индекс(ЭлементМассива);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,"СписокДопРеквизитов[" + ИндексСтроки + "].Элемент1БД");
			ЕстьОшибки = Истина;	
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ЕстьОшибки;
КонецФункции //rarus bonmak 17468 23.09.2021 --

&НаСервере
Процедура ПривязатьПерепривязатьЭлементыИз1БД(НайденныеСтроки) //rarus bonmak 17468 23.09.2021 ++
	СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(, Ложь);
	ЕстьОшибки = Ложь;
	Для Каждого ЭлементМассива Из НайденныеСтроки Цикл
		ЭлементОбъект = ЭлементМассива.ЭлементOFMS.ПолучитьОбъект();
		ЭлементОбъект.IDExternalSystem 				= ЭлементМассива.GUID1БД;
		ЭлементОбъект.Наименование 					= ЭлементМассива.Элемент1БД;
		ЭлементОбъект.ИспользуетсяВOFMS 			= ЭлементМассива.Получение;
		ЭлементОбъект.ИспользуетсяВOFMSДляОтправки 	= ЭлементМассива.Отправка;
		ЭлементОбъект.ТипДопРеквизитаOFMS 			= ЭлементМассива.ТипДанныхOFMS;
		ЭлементОбъект.Пользователь 					= ПользователиСлужебный.АвторизованныйПользователь();
		Попытка
			ЭлементОбъект.Записать();	
		Исключение
			ТекстОшибки = "Не удалось записать " + ЭлементМассива.Элемент1БД + " (" + ЭлементМассива.GUID1БД + ") по причине: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ИндексСтроки = СписокДопРеквизитов.Индекс(ЭлементМассива);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,"СписокДопРеквизитов[" + ИндексСтроки + "].Элемент1БД");	
			ЕстьОшибки = Истина;
			Продолжить;
		КонецПопытки;
		
		СтруктураПараметров.GUID = ЭлементОбъект.IDExternalSystem;
		Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetAdditionalProperty(СтруктураПараметров);	
	КонецЦикла;
	
	Если НЕ ЕстьОшибки Тогда
		ТекстОшибки = "Привязка/перепривязка доп. реквизитов успешно выполнена";
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ЗаполнитьДанныеВТаблице();
	КонецЕсли;
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

&НаКлиенте
Процедура Перезаполнить(Команда) //rarus bonmak 17468 23.09.2021 ++
	ЗаполнитьДанныеВТаблице();
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

&НаСервере
Процедура ЗаполнитьДанныеВТаблице() //rarus bonmak 17468 23.09.2021 ++
	СписокДопРеквизитов.Очистить();
	
	СтруктураПараметров = Новый Структура("ПолучитьСписокБезОбработки, ТаблицаДопРеквизитовИзмененная", Истина, СписокДопРеквизитов.Выгрузить());
	Scan_ВебСервисыРазборОтветов.ВызватьМетод_GetAdditionalProperty(СтруктураПараметров);
	СписокДопРеквизитов.Загрузить(СтруктураПараметров.ТаблицаДопРеквизитовИзмененная);
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

&НаКлиенте
Процедура УстановитьФлажки(Команда) //rarus bonmak 17468 23.09.2021 ++
	СнятьУстановитьФлажки(Истина);
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

&НаКлиенте
Процедура СнятьФлажки(Команда) //rarus bonmak 17468 23.09.2021 ++
	СнятьУстановитьФлажки(Ложь);
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

&НаСервере
Процедура СнятьУстановитьФлажки(Значение) //rarus bonmak 17468 23.09.2021 ++
	ТЗ = РеквизитФормыВЗначение("СписокДопРеквизитов");	
	ТЗ.ЗаполнитьЗначения(Значение, "Флаг");
	ЗначениеВРеквизитФормы(ТЗ, "СписокДопРеквизитов");
КонецПроцедуры //rarus bonmak 17468 23.09.2021 --

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
